app/controllers/image_posts_controller.rb

INSERT INTO "image_posts" ("img_file_name", "img_content_type", "img_file_size", "img_updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["img_file_name", "love.jpg"], ["img_content_type", "image/jpeg"], ["img_file_size", 55843], ["img_updated_at", "2017-11-06 00:15:48.673894"], ["user_id", 1]]
---
  def create
    @image = current_user.image_posts.build(permit_image_post)

    if @image.save

SELECT  "image_posts".* FROM "image_posts" WHERE "image_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "image_posts".* FROM "image_posts" WHERE "image_posts"."user_id" = ?  [["user_id", 1]]
---
  def show
    if params[:image_id]
      @images = [ImagePost.find(params[:image_id])]
    else
      @user = User.find(params[:user_id])
      @images = @user.image_posts.all

SELECT  "image_posts".* FROM "image_posts" WHERE "image_posts"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "image_posts" WHERE "image_posts"."id" = ?  [["id", 19]]
---
  def destroy
    @image = ImagePost.find(params[:image_id])
    if @image.destroy